Tekla Open API Reference for Tekla Structures 2025
PolymeshEnumerator.MoveNext Method
 Moves to the next item in the enumerator.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool MoveNext()
Public Function MoveNext As Boolean
Return Value
Type: Boolean
False on failure.
Implements
IEnumerator.MoveNext()
See Also
Reference
PolymeshEnumerator Class
Tekla.Structures.Model Namespace